# pandas

In [1]:
import numpy as np 
import pandas as pd

In [2]:
dic1={"name":["dhoni","rohit","virat"],
      "marks":[92,90,87],
      "city":["Rachi","mumbai","Delhi"],}

In [3]:
df=pd.DataFrame(dic1)
#creating a dataframe(just like exel)

In [4]:
df

    name  marks    city
0  dhoni     92   Rachi
1  rohit     90  mumbai
2  virat     87   Delhi

In [5]:
df.to_csv('player.csv')
#make csv file in computer

In [6]:
df.to_csv('player if.csv',index=False)
#make csv file in computer without index

In [7]:
df.head(2)#first 2 only

    name  marks    city
0  dhoni     92   Rachi
1  rohit     90  mumbai

In [8]:
df.tail(3)#first 3 only

    name  marks    city
0  dhoni     92   Rachi
1  rohit     90  mumbai
2  virat     87   Delhi

In [9]:
df.head()#first five only

    name  marks    city
0  dhoni     92   Rachi
1  rohit     90  mumbai
2  virat     87   Delhi

In [10]:
df.tail()#last five only

    name  marks    city
0  dhoni     92   Rachi
1  rohit     90  mumbai
2  virat     87   Delhi

In [11]:
df.describe()
#describeing a numerical column

           marks
count   3.000000
mean   89.666667
std     2.516611
min    87.000000
25%    88.500000
50%    90.000000
75%    91.000000
max    92.000000

In [12]:
milan=pd.read_csv('milan.csv')

In [13]:
milan

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1,...,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,train no,speed,city
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,27383,98,rajkot
1,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,282829,56,delhi
2,2,2,2,2,2,2,2,2,2,2,...,2,2,2,2,2,2,2,283839,50,Porbandar
3,3,3,3,3,3,3,3,3,3,3,...,3,3,3,3,3,3,3,728282,99,patna

In [14]:
milan['speed']

0    98
1    56
2    50
3    99
Name: speed, dtype: int64

In [15]:
milan['speed'][2]
#value at zero index

50

In [16]:
milan['speed'][2]=50
#change a value

<ipython-input-16-bf9dfbd867c2>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  milan['speed'][2]=50

In [17]:
milan

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1,...,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,train no,speed,city
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,27383,98,rajkot
1,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,282829,56,delhi
2,2,2,2,2,2,2,2,2,2,2,...,2,2,2,2,2,2,2,283839,50,Porbandar
3,3,3,3,3,3,3,3,3,3,3,...,3,3,3,3,3,3,3,728282,99,patna

In [18]:
milan.to_csv('milan.csv')

In [19]:
milan.index=['first','sec','third','four',]

In [20]:
milan

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1,...,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,Unnamed: 0.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1.1,train no,speed,city
first,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,27383,98,rajkot
sec,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,282829,56,delhi
third,2,2,2,2,2,2,2,2,2,2,...,2,2,2,2,2,2,2,283839,50,Porbandar
four,3,3,3,3,3,3,3,3,3,3,...,3,3,3,3,3,3,3,728282,99,patna

In [21]:
ser= pd.Series(np.random.rand)

In [22]:
type(ser)

pandas.core.series.Series

In [23]:
ser= pd.Series(np.random.rand(2))

In [24]:
ser

0    0.369256
1    0.610584
dtype: float64

In [25]:
newdf=pd.DataFrame(np.random.rand(3,2))

In [26]:
newdf

          0         1
0  0.294543  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [27]:
type(newdf)

pandas.core.frame.DataFrame

In [28]:
newdf.dtypes

0    float64
1    float64
dtype: object

In [29]:
newdf[0][0]="milan"

In [30]:
newdf

          0         1
0     milan  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [31]:
newdf.dtypes

0     object
1    float64
dtype: object

In [32]:
newdf.index

RangeIndex(start=0, stop=3, step=1)

In [33]:
newdf.columns

RangeIndex(start=0, stop=2, step=1)

In [34]:
newdf.to_numpy()

array([['milan', 0.052706160842735494],
       [0.40602641296014785, 0.06753954536706508],
       [0.19796257007710338, 0.5571897925816621]], dtype=object)

In [35]:
newdf[0][0]=45.47

<ipython-input-35-8e2d99e45879>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0]=45.47

In [36]:
newdf.head()

          0         1
0     45.47  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [37]:
newdf.T

           0          1         2
0      45.47   0.406026  0.197963
1  0.0527062  0.0675395   0.55719

In [38]:
newdf.sort_index(axis=0,ascending=False)

          0         1
2  0.197963  0.557190
1  0.406026  0.067540
0     45.47  0.052706

In [39]:
newdf.sort_index(axis=1,ascending=False)

          1         0
0  0.052706     45.47
1  0.067540  0.406026
2  0.557190  0.197963

In [40]:
newdf.head()

          0         1
0     45.47  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [41]:
newdf[0]

0       45.47
1    0.406026
2    0.197963
Name: 0, dtype: object

In [42]:
type(newdf)

pandas.core.frame.DataFrame

In [43]:
newdf2=newdf

In [44]:
newdf2[0][0]=577

<ipython-input-44-f9d90309744e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=577

In [45]:
newdf

          0         1
0       577  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [46]:
newdf3=newdf.copy()

In [47]:
newdf3[0][0]=56.78

<ipython-input-47-e5fa2d9a2117>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0]=56.78

In [48]:
newdf

          0         1
0       577  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [49]:
newdf.loc[0,0]=899

In [50]:
newdf

          0         1
0       899  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [51]:
newdf.columns=list("AB")

In [52]:
newdf

          A         B
0       899  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [53]:
newdf.loc[0,0]=899

In [54]:
newdf

          A         B      0
0       899  0.052706  899.0
1  0.406026  0.067540    NaN
2  0.197963  0.557190    NaN

In [55]:
newdf.loc[0,'A']=678

In [56]:
newdf

          A         B      0
0       678  0.052706  899.0
1  0.406026  0.067540    NaN
2  0.197963  0.557190    NaN

In [57]:
newdf=newdf.drop(0,axis=1)

In [58]:
newdf

          A         B
0       678  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [59]:
newdf.loc[[1,2],['A','B']]

          A        B
1  0.406026  0.06754
2  0.197963  0.55719

In [60]:
newdf

          A         B
0       678  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [61]:
newdf.loc[:,['A','B']]

          A         B
0       678  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [62]:
newdf.loc[(newdf['A']<0.3)]

          A        B
2  0.197963  0.55719

In [63]:
newdf.loc[(newdf['A']<0.3)&(newdf['B']>0.2)]

          A        B
2  0.197963  0.55719

In [64]:
newdf

          A         B
0       678  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [65]:
newdf.iloc[0,1]

0.052706160842735494

In [66]:
newdf.iloc[[0,1],[0,1]]

          A         B
0       678  0.052706
1  0.406026  0.067540

In [67]:
newdf.drop(0)

          A        B
1  0.406026  0.06754
2  0.197963  0.55719

In [68]:
newdf.drop(['A'],axis=1)

          B
0  0.052706
1  0.067540
2  0.557190

In [69]:
newdf

          A         B
0       678  0.052706
1  0.406026  0.067540
2  0.197963  0.557190

In [70]:
newdf.drop([1],axis=0,inplace=True)

In [71]:
newdf

          A         B
0       678  0.052706
2  0.197963  0.557190

In [72]:
newdf.reset_index()

   index         A         B
0      0       678  0.052706
1      2  0.197963  0.557190

In [73]:
newdf.reset_index(drop=True,inplace=True)

In [74]:
newdf

          A         B
0       678  0.052706
1  0.197963  0.557190

In [75]:
newdf['B'].isnull()

0    False
1    False
Name: B, dtype: bool

In [76]:
newdf['B']=None

In [77]:
newdf

          A     B
0       678  None
1  0.197963  None

In [78]:
newdf.loc[:,['B']]= None

In [79]:
newdf

          A     B
0       678  None
1  0.197963  None

In [80]:
newdf.loc[:,['B']]=67

In [81]:
newdf

          A   B
0       678  67
1  0.197963  67

In [82]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, 6, 1],

                    [np.nan, np.nan, np.nan, 5]],

                  columns=list('ABCD'))

In [83]:
df.head()

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  6.0  1
2  NaN  NaN  NaN  5

In [84]:
df.dropna()

     A    B    C  D
1  3.0  4.0  6.0  1

In [85]:
df.dropna(how='all')

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  6.0  1
2  NaN  NaN  NaN  5

In [86]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan,1],

                    [np.nan, np.nan, np.nan, 5]],

                  columns=list('ABCD'))

In [87]:
df.dropna(how='all',axis=1)

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [88]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan,1],

                    [np.nan, 2, np.nan, 5]],

                  columns=list('ABCD'))

In [89]:
df.drop_duplicates (subset=['B'])

     A  B   C  D
0  NaN  2 NaN  0
1  3.0  4 NaN  1

In [90]:
df.drop_duplicates (subset=['B'],keep='first')

     A  B   C  D
0  NaN  2 NaN  0
1  3.0  4 NaN  1

In [91]:
df.drop_duplicates (subset=['B'],keep='last')

     A  B   C  D
1  3.0  4 NaN  1
2  NaN  2 NaN  5

In [92]:
df.drop_duplicates (subset=['B'],keep=False)

     A  B   C  D
1  3.0  4 NaN  1

In [93]:
df.info

<bound method DataFrame.info of      A  B   C  D
0  NaN  2 NaN  0
1  3.0  4 NaN  1
2  NaN  2 NaN  5>

In [94]:
df['A'].value_counts(dropna=False)

NaN    2
3.0    1
Name: A, dtype: int64

In [95]:
df['A'].value_counts(dropna=True)

3.0    1
Name: A, dtype: int64

In [96]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True  False  True  False

In [97]:
df.notnull()

       A     B      C     D
0  False  True  False  True
1   True  True  False  True
2  False  True  False  True

# work with excel

In [98]:
data=pd.read_excel('data.xlsx',sheet_name='mk')

In [99]:
data

   Unnamed: 0  train no 2  speed       city
0           0       64646     98     rajkot
1           1      282829     56      delhi
2           2      283839     69  Porbandar
3           3      728282     99      patna

In [100]:
data=pd.read_excel('data.xlsx',sheet_name='mk1')

In [101]:
data

   Unnamed: 0  train no 2  speed       city
0           0          26     98     rajkot
1           1      282829     56      delhi
2           2      283839     69  Porbandar
3           3      728282     99      patna

In [102]:
data.iloc[0,0]=26

In [103]:
data

   Unnamed: 0  train no 2  speed       city
0          26          26     98     rajkot
1           1      282829     56      delhi
2           2      283839     69  Porbandar
3           3      728282     99      patna

In [104]:
data.to_excel('data.xlsx',sheet_name='mk1')